iarsystems/ewarm-st-example-projects/STM32L1xx/IAR-STM32L152VB-SK/bsp/stm32_glass_lcd.c

#include "stm32_glass_lcd.h"


/**
================================================================================
                              GLASS LCD MAPPING
================================================================================
               A
           ---------
          |\   |J  /|   _
        F | H  |  K |B | | COL
          |  \ | /  |   -
          --G-- --M--   _
          |   /| \  |  | |
        E |  Q |  N |C  -
          | /  |P  \|   _
           ---------   | |DP
              D         -
A LCD 14 segments character coding is based on the following matrix:
 SEG |  0  1  2  3
-----|-------------
COM0 |  N  D  P  -
COM1 |  M  C  Q  E
COM2 |  K  B  G  F
COM3 |  J  A  H  -


               A
           ---------
          |         |   _
        F |         |B | | COL
          |         |   -
           ----G----    _
          |         |  | |
        E |         |C  -
          |         |   _
           ---------   | |DP
              D         -
A LCD 7 segments character coding is based on the following matrix:

0-1
 SEG |  0  1
-----|-------
COM0 |  A  F
COM1 |  B  Q
COM2 |  C  E
COM3 |  -  D

2-3
 SEG |  0  1
-----|-------
COM0 |  B  A
COM1 |  G  F
COM2 |  C  E
COM3 |  D  -

*/

#define S14_SEG_A     ((3*4)+1)
#define S14_SEG_B     ((2*4)+1)
#define S14_SEG_C     ((1*4)+1)
#define S14_SEG_D     ((0*4)+1)
#define S14_SEG_E     ((1*4)+3)
#define S14_SEG_F     ((2*4)+3)
#define S14_SEG_G     ((2*4)+2)
#define S14_SEG_H     ((3*4)+2)
#define S14_SEG_J     ((3*4)+0)
#define S14_SEG_K     ((2*4)+0)
#define S14_SEG_M     ((1*4)+0)
#define S14_SEG_N     ((0*4)+0)
#define S14_SEG_P     ((0*4)+2)
#define S14_SEG_Q     ((1*4)+2)

#define S7A_SEG_A     ((0*4)+0)
#define S7A_SEG_B     ((1*4)+0)
#define S7A_SEG_C     ((2*4)+0)
#define S7A_SEG_D     ((3*4)+1)
#define S7A_SEG_E     ((2*4)+1)
#define S7A_SEG_F     ((0*4)+1)
#define S7A_SEG_G     ((1*4)+1)

#define S7B_SEG_A     ((0*4)+1)
#define S7B_SEG_B     ((0*4)+0)
#define S7B_SEG_C     ((2*4)+0)
#define S7B_SEG_D     ((3*4)+0)
#define S7B_SEG_E     ((2*4)+1)
#define S7B_SEG_F     ((1*4)+1)
#define S7B_SEG_G     ((1*4)+0)

#define SEG14(a,b,c,d,e,f,g,h,j,k,m,n,p,q) \
  (a<<S14_SEG_A) | (b<<S14_SEG_B) | (c<<S14_SEG_C) | (d<<S14_SEG_D) |\
  (e<<S14_SEG_E) | (f<<S14_SEG_F) | (g<<S14_SEG_G) | (h<<S14_SEG_H) |\
  (j<<S14_SEG_J) | (k<<S14_SEG_K) | (m<<S14_SEG_M) | (n<<S14_SEG_N) |\
  (p<<S14_SEG_P) | (q<<S14_SEG_Q)

#define SEG7A(a,b,c,d,e,f,g) \
  (a<<S7A_SEG_A) | (b<<S7A_SEG_B) | (c<<S7A_SEG_C) | (d<<S7A_SEG_D) | \
  (e<<S7A_SEG_E) | (f<<S7A_SEG_F) | (g<<S7A_SEG_G)

#define SEG7B(a,b,c,d,e,f,g) \
  (a<<S7B_SEG_A) | (b<<S7B_SEG_B) | (c<<S7B_SEG_C) | (d<<S7B_SEG_D) | \
  (e<<S7B_SEG_E) | (f<<S7B_SEG_F) | (g<<S7B_SEG_G)

#define SEG_MASK(seg)     (seg & (32-1))
#define SEG_EL(seg,com)   (volatile unsigned int *)(PERIPH_BASE + 0x2000000 + ((0x2400 + 0x14 + ((com*2) + ((seg<32)?0:1))*4)*32) + (SEG_MASK(seg)*4))

#define SEG_PL 				SEG_EL(39,3)  // +    0
#define SEG_MN 				SEG_EL(39,0)  // -    1
#define SEG_S14_1A  	SEG_EL(37,3)  // 1A   2
#define SEG_S14_1B  	SEG_EL(37,2)  // 1B   3
#define SEG_S14_1C  	SEG_EL(37,1)  // 1C   4
#define SEG_S14_1D  	SEG_EL(37,0)  // 1D   5
#define SEG_S14_1E  	SEG_EL(39,1)  // 1E   6
#define SEG_S14_1F  	SEG_EL(39,2)  // 1F   7
#define SEG_S14_1G  	SEG_EL(38,2)  // 1G   8
#define SEG_S14_1H  	SEG_EL(38,3)  // 1H   9
#define SEG_S14_1J  	SEG_EL(36,3)  // 1J   10
#define SEG_S14_1K  	SEG_EL(36,2)  // 1K   11
#define SEG_S14_1M  	SEG_EL(36,1)  // 1M   12
#define SEG_S14_1N  	SEG_EL(36,0)  // 1N   13
#define SEG_S14_1P  	SEG_EL(38,0)  // 1P   14
#define SEG_S14_1Q  	SEG_EL(38,1)  // 1Q   15
#define SEG_S14_1DP 	SEG_EL(35,0)  // 1DP  16
#define SEG_S14_1COL	SEG_EL(35,3)  // 1COL 17

#define SEG_S14_2A  	SEG_EL(33,3)  // 2A   18
#define SEG_S14_2B  	SEG_EL(33,2)  // 2B   19
#define SEG_S14_2C  	SEG_EL(33,1)  // 2C   20
#define SEG_S14_2D  	SEG_EL(33,0)  // 2D   21
#define SEG_S14_2E  	SEG_EL(35,1)  // 2E   22
#define SEG_S14_2F  	SEG_EL(35,2)  // 2F   23
#define SEG_S14_2G  	SEG_EL(34,2)  // 2G   24
#define SEG_S14_2H  	SEG_EL(34,3)  // 2H   25
#define SEG_S14_2J  	SEG_EL(32,3)  // 2J   26
#define SEG_S14_2K  	SEG_EL(32,2)  // 2K   27
#define SEG_S14_2M  	SEG_EL(32,1)  // 2M   28
#define SEG_S14_2N  	SEG_EL(32,0)  // 2N   29
#define SEG_S14_2P  	SEG_EL(34,0)  // 2P   30
#define SEG_S14_2Q  	SEG_EL(34,1)  // 2Q   31
#define SEG_S14_2DP 	SEG_EL(31,0)  // 2DP  32
#define SEG_S14_2COL	SEG_EL(31,3)  // 2COL 33

#define SEG_S14_3A  	SEG_EL(29,3)  // 3A   34
#define SEG_S14_3B  	SEG_EL(29,2)  // 3B   35
#define SEG_S14_3C  	SEG_EL(29,1)  // 3C   36
#define SEG_S14_3D  	SEG_EL(29,0)  // 3D   37
#define SEG_S14_3E  	SEG_EL(31,1)  // 3E   38
#define SEG_S14_3F  	SEG_EL(31,2)  // 3F   39
#define SEG_S14_3G  	SEG_EL(30,2)  // 3G   40
#define SEG_S14_3H  	SEG_EL(30,3)  // 3H   41
#define SEG_S14_3J  	SEG_EL(28,3)  // 3J   42
#define SEG_S14_3K  	SEG_EL(28,2)  // 3K   43
#define SEG_S14_3M  	SEG_EL(28,1)  // 3M   44
#define SEG_S14_3N  	SEG_EL(28,0)  // 3N   45
#define SEG_S14_3P  	SEG_EL(30,0)  // 3P   46
#define SEG_S14_3Q  	SEG_EL(30,1)  // 3Q   47
#define SEG_S14_3DP 	SEG_EL(27,0)  // 3DP  48
#define SEG_S14_3COL	SEG_EL(27,3)  // 3COL 49

#define SEG_S14_4A  	SEG_EL(25,3)  // 4A   50
#define SEG_S14_4B  	SEG_EL(25,2)  // 4B   51
#define SEG_S14_4C  	SEG_EL(25,1)  // 4C   52
#define SEG_S14_4D  	SEG_EL(25,0)  // 4D   53
#define SEG_S14_4E  	SEG_EL(27,1)  // 4E   54
#define SEG_S14_4F  	SEG_EL(27,2)  // 4F   55
#define SEG_S14_4G  	SEG_EL(26,2)  // 4G   56
#define SEG_S14_4H  	SEG_EL(26,3)  // 4H   57
#define SEG_S14_4J  	SEG_EL(24,3)  // 4J   58
#define SEG_S14_4K  	SEG_EL(24,2)  // 4K   59
#define SEG_S14_4M  	SEG_EL(24,1)  // 4M   60
#define SEG_S14_4N  	SEG_EL(24,0)  // 4N   61
#define SEG_S14_4P  	SEG_EL(26,0)  // 4P   62
#define SEG_S14_4Q  	SEG_EL(26,1)  // 4Q   63
#define SEG_S14_4DP 	SEG_EL(23,0)  // 4DP  64
#define SEG_S14_4COL	SEG_EL(23,3)  // 4COL 65

#define SEG_S14_5A  	SEG_EL(21,3)  // 5A   66
#define SEG_S14_5B  	SEG_EL(21,2)  // 5B   67
#define SEG_S14_5C  	SEG_EL(21,1)  // 5C   68
#define SEG_S14_5D  	SEG_EL(21,0)  // 5D   69
#define SEG_S14_5E  	SEG_EL(23,1)  // 5E   70
#define SEG_S14_5F  	SEG_EL(23,2)  // 5F   71
#define SEG_S14_5G  	SEG_EL(22,2)  // 5G   72
#define SEG_S14_5H  	SEG_EL(22,3)  // 5H   73
#define SEG_S14_5J  	SEG_EL(20,3)  // 5J   74
#define SEG_S14_5K  	SEG_EL(20,2)  // 5K   75
#define SEG_S14_5M  	SEG_EL(20,1)  // 5M   76
#define SEG_S14_5N  	SEG_EL(20,0)  // 5N   77
#define SEG_S14_5P  	SEG_EL(22,0)  // 5P   78
#define SEG_S14_5Q  	SEG_EL(22,1)  // 5Q   79
#define SEG_S14_5DP 	SEG_EL(19,0)  // 5DP  80
#define SEG_S14_5COL	SEG_EL(19,3)  // 5COL 81

#define SEG_S14_6A  	SEG_EL(17,3)  // 6A   82
#define SEG_S14_6B  	SEG_EL(17,2)  // 6B   83
#define SEG_S14_6C  	SEG_EL(17,1)  // 6C   84
#define SEG_S14_6D  	SEG_EL(17,0)  // 6D   85
#define SEG_S14_6E  	SEG_EL(19,1)  // 6E   86
#define SEG_S14_6F  	SEG_EL(19,2)  // 6F   87
#define SEG_S14_6G  	SEG_EL(18,2)  // 6G   88
#define SEG_S14_6H  	SEG_EL(18,3)  // 6H   89
#define SEG_S14_6J  	SEG_EL(16,3)  // 6J   90
#define SEG_S14_6K  	SEG_EL(16,2)  // 6K   91
#define SEG_S14_6M  	SEG_EL(16,1)  // 6M   92
#define SEG_S14_6N  	SEG_EL(16,0)  // 6N   93
#define SEG_S14_6P  	SEG_EL(18,0)  // 6P   94
#define SEG_S14_6Q  	SEG_EL(18,1)  // 6Q   95
#define SEG_S14_6DP 	SEG_EL(15,0)  // 6DP  96

