iarsystems/ewarm-st-example-projects/STM32L1xx/IAR-STM32L152VB-SK/bsp/stm32_glass_lcd.c
#define SEG_S14_7A  	SEG_EL(13,3)  // 7A   97
#define SEG_S14_7B  	SEG_EL(13,2)  // 7B   98
#define SEG_S14_7C  	SEG_EL(13,1)  // 7C   99
#define SEG_S14_7D  	SEG_EL(13,0)  // 7D   100
#define SEG_S14_7E  	SEG_EL(15,1)  // 7E   101
#define SEG_S14_7F  	SEG_EL(15,2)  // 7F   102
#define SEG_S14_7G  	SEG_EL(14,2)  // 7G   103
#define SEG_S14_7H  	SEG_EL(14,3)  // 7H   104
#define SEG_S14_7J  	SEG_EL(12,3)  // 7J   105
#define SEG_S14_7K  	SEG_EL(12,2)  // 7K   106
#define SEG_S14_7M  	SEG_EL(12,1)  // 7M   107
#define SEG_S14_7N  	SEG_EL(12,0)  // 7N   108
#define SEG_S14_7P  	SEG_EL(14,0)  // 7P   109
#define SEG_S14_7Q  	SEG_EL(14,1)  // 7Q   110

#define SEG_MICRO 		SEG_EL(1 ,3)  // A1   111
#define SEG_MIL 		  SEG_EL(1 ,2)  // A2   112
#define SEG_H					SEG_EL(1 ,1)  // A3   113
#define SEG_F					SEG_EL(1 ,0)  // A4   114

#define SEG_BATT			SEG_EL(2 ,0)  // BRBL 115
#define SEG_BATT_0		SEG_EL(2 ,3)  // B0   116
#define SEG_BATT_1		SEG_EL(2 ,2)  // B1   117
#define SEG_BATT_2		SEG_EL(2 ,1)  // B2   118

#define SEG_BARR_PL 	SEG_EL(0 ,3)  // PL   119
#define SEG_BARR_P0 	SEG_EL(0 ,2)  // P0   120
#define SEG_BARR_P1 	SEG_EL(0 ,1)  // P1   121
#define SEG_BARR_P2 	SEG_EL(0 ,0)  // P2   122
#define SEG_BARR_P3 	SEG_EL(43,0)  // P3   123
#define SEG_BARR_P4 	SEG_EL(43,1)  // P4   124
#define SEG_BARR_P5 	SEG_EL(43,2)  // P5   125
#define SEG_BARR_P6 	SEG_EL(43,3)  // P6   126
#define SEG_BARR_P7 	SEG_EL(42,3)  // P7   127
#define SEG_BARR_P8 	SEG_EL(42,2)  // P8   128
#define SEG_BARR_P9 	SEG_EL(42,1)  // P9   129
#define SEG_BARR_PR 	SEG_EL(42,0)  // PR   130

#define SEG_AL				SEG_EL(3 ,0)  // AL   131
#define SEG_AU				SEG_EL(3 ,1)  // AU   132
#define SEG_AR				SEG_EL(3 ,2)  // AR   133
#define SEG_AD				SEG_EL(3 ,3)  // AD   134

#define SEG_OLIMEX		SEG_EL(15,3)  // SB   135

#define SEG_S7_8A 		SEG_EL(10,0)  // 8A   136
#define SEG_S7_8B 		SEG_EL(10,1)  // 8B   137
#define SEG_S7_8C 		SEG_EL(10,2)  // 8C   138
#define SEG_S7_8D 		SEG_EL(11,3)  // 8D   139
#define SEG_S7_8E 		SEG_EL(11,2)  // 8E   140
#define SEG_S7_8F 		SEG_EL(11,0)  // 8F   141
#define SEG_S7_8G 		SEG_EL(11,1)  // 8G   142
#define SEG_S7_8P 		SEG_EL(10,3)  // 8P   143

#define SEG_S7_9A 		SEG_EL(8 ,0)  // 9A   144
#define SEG_S7_9B 		SEG_EL(8 ,1)  // 9B   145
#define SEG_S7_9C 		SEG_EL(8 ,2)  // 9C   146
#define SEG_S7_9D 		SEG_EL(9 ,3)  // 9D   147
#define SEG_S7_9E 		SEG_EL(9 ,2)  // 9E   148
#define SEG_S7_9F 		SEG_EL(9 ,0)  // 9F   149
#define SEG_S7_9G 		SEG_EL(9 ,1)  // 9G   150
#define SEG_S7_9P 		SEG_EL(8 ,3)  // 10P  151
#define SEG_S7_9COL		SEG_EL(7 ,3)  // 10COLON  152

#define SEG_S7_10A 		SEG_EL(7 ,0)  // 10A  153
#define SEG_S7_10B 		SEG_EL(6 ,0)  // 10B  154
#define SEG_S7_10C 		SEG_EL(6 ,2)  // 10C  155
#define SEG_S7_10D 		SEG_EL(6 ,3)  // 10D  156
#define SEG_S7_10E 		SEG_EL(7 ,2)  // 10E  157
#define SEG_S7_10F 		SEG_EL(7 ,1)  // 10F  158
#define SEG_S7_10G 		SEG_EL(6 ,1)  // 10G  159
#define SEG_S7_10P 		SEG_EL(5 ,3)  // 10P  160

#define SEG_S7_11A 		SEG_EL(5 ,0)  // 11A  161
#define SEG_S7_11B 		SEG_EL(4 ,0)  // 11B  162
#define SEG_S7_11C 		SEG_EL(4 ,2)  // 11C  163
#define SEG_S7_11D 		SEG_EL(4 ,3)  // 11D  164
#define SEG_S7_11E 		SEG_EL(5 ,2)  // 11E  165
#define SEG_S7_11F 		SEG_EL(5 ,1)  // 11F  166
#define SEG_S7_11G 		SEG_EL(4 ,1)  // 11G  167

const uint16_t S14_FontMap[]=
{
  SEG14(1,1,1,1,1,1,0,0,0,1,0,0,0,1), /* 0   - 0 */
  SEG14(0,1,1,0,0,0,0,0,0,0,0,0,0,0), /* 1   - 1 */
  SEG14(1,1,0,1,1,0,1,0,0,0,1,0,0,0), /* 2   - 2 */
  SEG14(1,1,1,1,0,0,0,0,0,0,1,0,0,0), /* 3   - 3 */
  SEG14(0,1,1,0,0,1,1,0,0,0,1,0,0,0), /* 4   - 4 */
  SEG14(1,0,0,1,0,1,1,0,0,0,0,1,0,0), /* 5   - 5 */
  SEG14(1,0,1,1,1,1,1,0,0,0,1,0,0,0), /* 6   - 6 */
  SEG14(1,1,1,0,0,0,0,0,0,0,0,0,0,0), /* 7   - 7 */
  SEG14(1,1,1,1,1,1,1,0,0,0,1,0,0,0), /* 8   - 8 */
  SEG14(1,1,1,1,0,1,1,0,0,0,1,0,0,0), /* 9   - 9 */
  SEG14(1,1,1,0,1,1,1,0,0,0,1,0,0,0), /* 10  - A */
  SEG14(1,1,1,1,0,0,0,0,1,0,1,0,1,0), /* 11  - B */
  SEG14(1,0,0,1,1,1,0,0,0,0,0,0,0,0), /* 12  - C */
  SEG14(1,1,1,1,0,0,0,0,1,0,0,0,1,0), /* 13  - D */
  SEG14(1,0,0,1,1,1,1,0,0,0,1,0,0,0), /* 14  - E */
  SEG14(1,0,0,0,1,1,1,0,0,0,0,0,0,0), /* 15  - F */
  SEG14(0,0,0,0,0,0,0,0,0,0,0,0,0,0), /* 16  -   */
  SEG14(0,0,0,0,0,0,0,0,0,0,0,0,0,0), /* 17  -   */
  SEG14(0,0,0,0,0,0,0,0,0,0,0,0,0,0), /* 18  -   */
  SEG14(0,0,0,0,0,0,0,0,0,0,0,0,0,0), /* 19  -   */
  SEG14(0,0,0,0,0,0,0,0,0,0,0,0,0,0), /* 20  -   */
  SEG14(0,0,0,0,0,0,0,0,0,0,0,0,0,0), /* 21  -   */
  SEG14(0,0,0,0,0,0,0,0,0,0,0,0,0,0), /* 22  -   */
  SEG14(0,0,0,0,0,0,0,0,0,0,0,0,0,0), /* 23  -   */
  SEG14(1,0,0,1,0,0,1,0,1,0,1,0,1,0), /* 24  - 01*/
  SEG14(0,0,0,0,0,0,1,1,0,1,1,0,1,0), /* 25  - 02*/
  SEG14(1,0,0,1,1,1,1,0,1,0,1,0,1,0), /* 26  - 03*/
  SEG14(1,1,0,0,0,1,1,0,0,0,1,0,0,0), /* 27  - 04*/
  SEG14(0,0,0,0,1,1,0,1,0,1,0,0,0,0), /* 28  - 05*/
  SEG14(0,0,0,1,0,0,1,0,1,0,1,0,1,0), /* 29  - +-*/
  SEG14(0,0,0,0,0,0,0,0,1,0,0,1,1,1), /* 30  - 06*/
  SEG14(0,0,0,0,0,0,0,1,1,1,0,0,1,0), /* 31  - 07*/
  SEG14(0,0,0,0,0,0,0,0,0,0,0,0,0,0), /* 32  -   */
  SEG14(0,1,1,0,0,0,0,0,0,0,0,0,0,0), /* 33  - | */
  SEG14(0,0,0,0,0,1,0,0,1,0,0,0,0,0), /* 34  - 08*/
  SEG14(1,1,1,1,1,1,1,1,1,1,1,1,1,1), /* 35  - 09*/
  SEG14(1,0,1,1,0,1,1,0,1,0,1,0,1,0), /* 36  - $*/
  SEG14(0,0,1,0,0,1,1,1,0,1,1,1,0,1), /* 37  - 10*/
  SEG14(1,0,1,1,0,0,0,1,0,1,0,1,0,1), /* 38  - 11*/
  SEG14(0,0,0,0,0,0,0,0,0,1,0,0,0,0), /* 39  - ' */
  SEG14(0,0,0,0,0,0,0,0,0,1,0,1,0,0), /* 40  - < */
  SEG14(0,0,0,0,0,0,0,1,0,0,0,0,0,1), /* 41  - > */
  SEG14(0,0,0,0,0,0,1,1,1,1,1,1,1,1), /* 42  - * */
  SEG14(0,0,0,0,0,0,1,0,1,0,1,0,1,0), /* 43  - + */
  SEG14(0,0,0,0,0,0,0,0,0,0,0,0,0,1), /* 44  - , */
  SEG14(0,0,0,0,0,0,1,0,0,0,1,0,0,0), /* 45  - - */
  SEG14(0,0,0,1,1,0,1,0,0,0,0,0,1,0), /* 46  - 12*/
  SEG14(0,0,0,0,0,0,0,0,0,1,0,0,0,1), /* 47  - / */
  SEG14(1,1,1,1,1,1,0,0,0,1,0,0,0,1), /* 48  - 0 */
  SEG14(0,1,1,0,0,0,0,0,0,0,0,0,0,0), /* 49  - 1 */
  SEG14(1,1,0,1,1,0,1,0,0,0,1,0,0,0), /* 50  - 2 */
  SEG14(1,1,1,1,0,0,0,0,0,0,1,0,0,0), /* 51  - 3 */
  SEG14(0,1,1,0,0,1,1,0,0,0,1,0,0,0), /* 52  - 4 */
  SEG14(1,0,0,1,0,1,1,0,0,0,0,1,0,0), /* 53  - 5 */
  SEG14(1,0,1,1,1,1,1,0,0,0,1,0,0,0), /* 54  - 6 */
  SEG14(1,1,1,0,0,0,0,0,0,0,0,0,0,0), /* 55  - 7 */
  SEG14(1,1,1,1,1,1,1,0,0,0,1,0,0,0), /* 56  - 8 */
  SEG14(1,1,1,1,0,1,1,0,0,0,1,0,0,0), /* 57  - 9 */
  SEG14(0,0,0,0,0,0,0,0,1,0,0,0,1,0), /* 58  - | */
  SEG14(0,0,0,0,0,0,0,0,1,0,0,0,0,1), /* 59  - 13*/
  SEG14(0,0,0,0,0,0,0,0,0,1,0,1,0,0), /* 60  - < */
  SEG14(0,0,0,1,0,0,1,0,0,0,1,0,0,0), /* 61  - = */
  SEG14(0,0,0,0,0,0,0,1,0,0,0,0,0,1), /* 62  - > */
  SEG14(1,1,0,0,0,0,0,0,1,0,0,0,1,0), /* 63  - ? */
  SEG14(1,1,0,1,1,1,0,0,1,0,1,0,0,0), /* 64  - @ */
  SEG14(1,1,1,0,1,1,1,0,0,0,1,0,0,0), /* 65  - A */
  SEG14(1,1,1,1,0,0,0,0,1,0,1,0,1,0), /* 66  - B */
  SEG14(1,0,0,1,1,1,0,0,0,0,0,0,0,0), /* 67  - C */
  SEG14(1,1,1,1,0,0,0,0,1,0,0,0,1,0), /* 68  - D */
  SEG14(1,0,0,1,1,1,1,0,0,0,1,0,0,0), /* 69  - E */
  SEG14(1,0,0,0,1,1,1,0,0,0,0,0,0,0), /* 70  - F */
  SEG14(1,0,1,1,1,1,0,0,0,0,1,0,0,0), /* 71  - G */
  SEG14(0,1,1,0,1,1,1,0,0,0,1,0,0,0), /* 72  - H */
  SEG14(0,0,0,0,0,0,0,0,1,0,0,0,1,0), /* 73  - I */
  SEG14(0,1,1,1,1,0,0,0,0,0,0,0,0,0), /* 74  - J */
  SEG14(0,0,0,0,1,1,1,0,0,1,0,1,0,0), /* 75  - K */
  SEG14(0,0,0,1,1,1,0,0,0,0,0,0,0,0), /* 76  - L */
  SEG14(0,1,1,0,1,1,0,1,0,1,0,0,0,0), /* 77  - M */
  SEG14(0,1,1,0,1,1,0,1,0,0,0,1,0,0), /* 78  - N */
  SEG14(1,1,1,1,1,1,0,0,0,0,0,0,0,0), /* 79  - O */
  SEG14(1,1,0,0,1,1,1,0,0,0,1,0,0,0), /* 80  - P */
  SEG14(1,1,1,1,1,1,0,0,0,0,0,1,0,0), /* 81  - Q */
  SEG14(1,1,0,0,1,1,1,0,0,0,1,1,0,0), /* 82  - R */
  SEG14(1,0,1,1,0,1,1,0,0,0,1,0,0,0), /* 83  - S */
  SEG14(1,0,0,0,0,0,0,0,1,0,0,0,1,0), /* 84  - T */
  SEG14(0,1,1,1,1,1,0,0,0,0,0,0,0,0), /* 85  - U */
  SEG14(0,0,0,0,1,1,0,0,0,1,0,0,0,1), /* 86  - V */
  SEG14(0,1,1,0,1,1,0,0,0,0,0,1,0,1), /* 87  - W */
  SEG14(0,0,0,0,0,0,0,1,0,1,0,1,0,1), /* 88  - X */
  SEG14(0,0,0,0,0,0,0,1,0,1,0,0,1,0), /* 89  - Y */
  SEG14(1,0,0,1,0,0,0,0,0,1,0,0,0,1), /* 90  - Z */
  SEG14(1,0,0,1,1,1,0,0,0,0,0,0,0,0), /* 91  - [ */
  SEG14(0,0,0,0,0,0,0,1,0,0,0,1,0,0), /* 92  - \ */
  SEG14(1,1,1,1,0,0,0,0,0,0,0,0,0,0), /* 93  - ] */
  SEG14(1,1,0,0,0,0,0,0,0,1,0,0,0,1), /* 94  - 14*/
  SEG14(0,0,0,1,0,0,0,0,0,0,0,0,0,0), /* 95  - _*/
  SEG14(0,0,0,0,0,0,0,1,0,0,0,0,0,0), /* 96  - ` */
  SEG14(1,1,1,0,1,1,1,0,0,0,1,0,0,0), /* 97  - A */
  SEG14(1,1,1,1,0,0,0,0,1,0,1,0,1,0), /* 98  - B */
  SEG14(1,0,0,1,1,1,0,0,0,0,0,0,0,0), /* 99  - C */
  SEG14(1,1,1,1,0,0,0,0,1,0,0,0,1,0), /* 100 - D */
  SEG14(1,0,0,1,1,1,1,0,0,0,1,0,0,0), /* 101 - E */
  SEG14(1,0,0,0,1,1,1,0,0,0,0,0,0,0), /* 102 - F */
  SEG14(1,0,1,1,1,1,0,0,0,0,1,0,0,0), /* 103 - G */
  SEG14(0,1,1,0,1,1,1,0,0,0,1,0,0,0), /* 104 - H */
  SEG14(0,0,0,0,0,0,0,0,1,0,0,0,1,0), /* 105 - I */
  SEG14(0,1,1,1,1,0,0,0,0,0,0,0,0,0), /* 106 - J */
  SEG14(0,0,0,0,1,1,1,0,0,1,0,1,0,0), /* 107 - K */
  SEG14(0,0,0,1,1,1,0,0,0,0,0,0,0,0), /* 108 - L */
  SEG14(0,1,1,0,1,1,0,1,0,1,0,0,0,0), /* 109 - M */
  SEG14(0,1,1,0,1,1,0,1,0,0,0,1,0,0), /* 110 - N */
  SEG14(1,1,1,1,1,1,0,0,0,0,0,0,0,0), /* 111 - O */
  SEG14(1,1,0,0,1,1,1,0,0,0,1,0,0,0), /* 112 - P */
  SEG14(1,1,1,1,1,1,0,0,0,0,0,1,0,0), /* 113 - Q */
  SEG14(1,1,0,0,1,1,1,0,0,0,1,1,0,0), /* 114 - R */
  SEG14(1,0,1,1,0,1,1,0,0,0,1,0,0,0), /* 115 - S */
  SEG14(1,0,0,0,0,0,0,0,1,0,0,0,1,0), /* 116 - T */
  SEG14(0,1,1,1,1,1,0,0,0,0,0,0,0,0), /* 117 - U */
  SEG14(0,0,0,0,1,1,0,0,0,1,0,0,0,1), /* 118 - V */
  SEG14(0,1,1,0,1,1,0,0,0,0,0,1,0,1), /* 119 - W */
  SEG14(0,0,0,0,0,0,0,1,0,1,0,1,0,1), /* 120 - X */
  SEG14(0,0,0,0,0,0,0,1,0,1,0,0,1,0), /* 121 - Y */
  SEG14(1,0,0,1,0,0,0,0,0,1,0,0,0,1), /* 122 - Z */
  SEG14(0,0,0,0,0,0,1,0,0,1,0,1,0,0), /* 123 - 15*/
  SEG14(0,0,0,0,0,0,0,0,1,0,0,0,1,0), /* 124 - | */
  SEG14(0,0,0,0,0,0,0,1,0,0,1,0,0,1), /* 125 - 16*/
  SEG14(0,1,0,0,1,0,1,0,0,0,1,0,0,0), /* 126 - 17*/
  SEG14(1,1,1,1,1,1,0,0,0,0,0,0,0,0), /* 127 - O */
};

const uint16_t S7A_DigitMap[]=
{
  SEG7A(1,1,1,1,1,1,0), /* 0 - 0 */
  SEG7A(0,1,1,0,0,0,0), /* 1 - 1 */
  SEG7A(1,1,0,1,1,0,1), /* 2 - 2 */
  SEG7A(1,1,1,1,0,0,1), /* 3 - 3 */
  SEG7A(0,1,1,0,0,1,1), /* 4 - 4 */
  SEG7A(1,0,1,1,0,1,1), /* 5 - 5 */
  SEG7A(1,0,1,1,1,1,1), /* 6 - 6 */
  SEG7A(1,1,1,0,0,0,0), /* 7 - 7 */
  SEG7A(1,1,1,1,1,1,1), /* 8 - 8 */
  SEG7A(1,1,1,1,0,1,1), /* 9 - 9 */
  SEG7A(1,1,1,0,1,1,1), /* 10 - A */
  SEG7A(0,0,1,1,1,1,1), /* 11 - b */
  SEG7A(1,0,0,1,1,1,0), /* 12 - C */
  SEG7A(0,1,1,1,1,0,1), /* 13 - d */
  SEG7A(1,0,0,1,1,1,1), /* 14 - E */
  SEG7A(1,0,0,0,1,1,1), /* 15 - F */
};

