iarsystems/ewarm-st-example-projects/STM32L1xx/IAR-STM32L152VB-SK/bsp/stm32_glass_lcd.c
const uint16_t S7B_DigitMap[]=
{
  SEG7B(1,1,1,1,1,1,0), /* 0 - 0 */
  SEG7B(0,1,1,0,0,0,0), /* 1 - 1 */
  SEG7B(1,1,0,1,1,0,1), /* 2 - 2 */
  SEG7B(1,1,1,1,0,0,1), /* 3 - 3 */
  SEG7B(0,1,1,0,0,1,1), /* 4 - 4 */
  SEG7B(1,0,1,1,0,1,1), /* 5 - 5 */
  SEG7B(1,0,1,1,1,1,1), /* 6 - 6 */
  SEG7B(1,1,1,0,0,0,0), /* 7 - 7 */
  SEG7B(1,1,1,1,1,1,1), /* 8 - 8 */
  SEG7B(1,1,1,1,0,1,1), /* 9 - 9 */
  SEG7B(1,1,1,0,1,1,1), /* 10 - A */
  SEG7B(0,0,1,1,1,1,1), /* 11 - b */
  SEG7B(1,0,0,1,1,1,0), /* 12 - C */
  SEG7B(0,1,1,1,1,0,1), /* 13 - d */
  SEG7B(1,0,0,1,1,1,1), /* 14 - E */
  SEG7B(1,0,0,0,1,1,1), /* 15 - F */
};

static void LCD_GPIOConfig(void);
static void LCD_GLASS_WriteChar(uint8_t* ch, Point_Typedef point, Semicol_Typedef semicom, uint8_t position);

/**
  * @brief Configures the LCD GLASS relative GPIO port IOs and LCD peripheral.
  * @param : None
  * @retval: None
  */
void LCD_GLASS_Init(void)
{
  LCD_InitTypeDef LCD_InitStructure;

  LCD_GPIOConfig(); /*!< Configure the LCD Glass GPIO pins */

  /*!< Configure the LCD interface -------------------------------------------*/
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_LCD, ENABLE); /*!< Enable LCD APB1 Clock */

  LCD_InitStructure.LCD_Prescaler = LCD_Prescaler_2;
  LCD_InitStructure.LCD_Divider = LCD_Divider_20;
  LCD_InitStructure.LCD_Duty = LCD_Duty_1_4;
  LCD_InitStructure.LCD_Bias = LCD_Bias_1_3;
  LCD_InitStructure.LCD_VoltageSource = LCD_VoltageSource_Internal;
  LCD_Init(&LCD_InitStructure);
  LCD_MuxSegmentCmd(DISABLE);

  /*!< High drive enable */
  LCD_HighDriveCmd(ENABLE);

  /*!< Configure the Pulse On Duration */
  LCD_PulseOnDurationConfig(LCD_PulseOnDuration_3);

  /*!< Configure the LCD Contrast */
  LCD_ContrastConfig(LCD_Contrast_Level_0);

  /*!< Wait Until the LCD FCR register is synchronized */
  LCD_WaitForSynchro();

  /*!< Enable LCD peripheral */
  LCD_Cmd(ENABLE);

  /*!< Wait Until the LCD is enabled */
  while(LCD_GetFlagStatus(LCD_FLAG_ENS) == RESET)
  {
  }
  /*!< Wait Until the LCD Booster is ready */
  while(LCD_GetFlagStatus(LCD_FLAG_RDY) == RESET)
  {
  }
}

/**
  * @brief This function writes a char in the LCD RAM.
  * @param car: The character to dispaly.
  * @param point: A point to add in front of char.
  *               This parameter  can be one of the following values:
  * @arg 0 : No point to add in back of char.
  * @arg 1 : Add a point in back of char.
  * @param Semicol_Typedef: Flag indicating if a semicolone has to be add in back of
  *                    displayed character
  *                    This parameter  can be one of the following values:
  * @arg 0 : No point to add in back of char.
  * @arg 1 : Add a point in back of char.
  * @param position: Position in the LCD of the caracter to write.
  *                  This parameter can be any value in range [0:7].
  * @retval: None
  */
void LCD_GLASS_DisplayChar(uint8_t* ch, Point_Typedef point, Semicol_Typedef semicol, uint8_t position)
{
  /*!< Wait Until the last LCD RAM update finish */
  while(LCD_GetFlagStatus(LCD_FLAG_UDR) != RESET)
  {
  }
  /*!< LCD Write Char */
  LCD_GLASS_WriteChar(ch, point, semicol, position);

  /*!< Requesy LCD RAM update */
  LCD_UpdateDisplayRequest();
}

/**
  * @brief This function writes a char in the LCD RAM.
  * @param ptr: Pointer to string to display on the LCD Glass.
  * @retval: None
  */
void LCD_GLASS_DisplayString(uint8_t* ptr)
{
  uint32_t i = 0x00;

  /*!< Wait Until the last LCD RAM update finish */
  while(LCD_GetFlagStatus(LCD_FLAG_UDR) != RESET)
  {
  }

  /*!< Send the string character by character on lCD */
  while ((*ptr != 0) & (i < 7))
  {
    /*!< Display one character on LCD */
    LCD_GLASS_WriteChar(ptr, POINT_OFF, SEMICOL_OFF, i);
    /*!< Point on the next character */
    ptr++;
    /*!< Increment the character counter */
    i++;
  }
  /*!< Requesy LCD RAM update */
  LCD_UpdateDisplayRequest();
}

/**
  * @brief This function writes a char in the LCD RAM.
  * @param car: The character to dispaly.
  * @param point: A point to add in front of char.
  *               This parameter  can be one of the following values:
  * @arg 0 : No point to add in front of char.
  * @arg 1 : Add a point in front of char.
  * @param apostrophe: Flag indicating if a apostrophe has to be add in front of
  *                    displayed character
  *                    This parameter  can be one of the following values:
  * @arg 0 : No point to add in back of char.
  * @arg 1 : Add a point in back of char.
  * @param position: Position in the LCD of the caracter to write.
  *                  This parameter can be any value in range [0:7].
  * @retval: None
  */
static void LCD_GLASS_WriteChar(uint8_t* ch, Point_Typedef point, Semicol_Typedef semicom, uint8_t position)
{
  uint32_t tmp = 0x00;
  uint8_t offset = *ch & 0x7F;

  switch (position)
  {

    case 0:
      /*!< Clear the corresponding segments (SEG36, SEG37, SEG38, SEG39) */
      LCD->RAM[LCD_RAMRegister_1] &= (uint32_t)(0xFFFFFF0F);
      LCD->RAM[LCD_RAMRegister_3] &= (uint32_t)(0xFFFFFF0F);
      LCD->RAM[LCD_RAMRegister_5] &= (uint32_t)(0xFFFFFF0F);
      LCD->RAM[LCD_RAMRegister_7] &= (uint32_t)(0xFFFFFF9F);

      /*!< Write the corresponding segments (SEG36, SEG37, SEG38, SEG39) */
      tmp = S14_FontMap[offset];
      LCD->RAM[LCD_RAMRegister_1] |= (tmp << 4) & 0x00F0;
      LCD->RAM[LCD_RAMRegister_3] |= (tmp << 0) & 0x00F0;
      LCD->RAM[LCD_RAMRegister_5] |= (tmp >> 4) & 0x00F0;
      LCD->RAM[LCD_RAMRegister_7] |= (tmp >> 8) & 0x0060;
      *SEG_S14_1DP  = point;
      *SEG_S14_1COL = semicom;
      break;

    case 1:
      /*!< Clear the corresponding segments (SEG35, SEG34, SEG33, SEG32) */
      LCD->RAM[LCD_RAMRegister_1] &= (uint32_t)(0xFFFFFFF8);
      LCD->RAM[LCD_RAMRegister_3] &= (uint32_t)(0xFFFFFFF0);
      LCD->RAM[LCD_RAMRegister_5] &= (uint32_t)(0xFFFFFFF0);
      LCD->RAM[LCD_RAMRegister_7] &= (uint32_t)(0xFFFFFFF8);

      /*!< Write the corresponding segments (SEG35, SEG34, SEG33, SEG32) */
      tmp = S14_FontMap[offset];
      LCD->RAM[LCD_RAMRegister_1] |= (tmp << 0) & 0x0007;
      LCD->RAM[LCD_RAMRegister_3] |= (tmp >> 4) & 0x000F;
      LCD->RAM[LCD_RAMRegister_5] |= (tmp >> 8) & 0x000F;
      LCD->RAM[LCD_RAMRegister_7] |= (tmp >>12) & 0x0007;
      *SEG_S14_2DP  = point;
      *SEG_S14_2COL = semicom;
      break;

