iarsystems/ewarm-st-example-projects/STM32L1xx/IAR-STM32L152VB-SK/bsp/stm32_glass_lcd.c
    case 2:
      /*!< Clear the corresponding segments (SEG28, SEG29, SEG30, SEG31) */
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)(0x8FFFFFFF);
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)(0x0FFFFFFF);
      LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)(0x0FFFFFFF);
      LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)(0x8FFFFFFF);

      /*!< Write the corresponding segments (SEG28, SEG29, SEG30, SEG31) */
      tmp = S14_FontMap[offset];
      LCD->RAM[LCD_RAMRegister_0] |= (tmp <<28) & 0x70000000;
      LCD->RAM[LCD_RAMRegister_2] |= (tmp <<24) & 0xF0000000;
      LCD->RAM[LCD_RAMRegister_4] |= (tmp <<20) & 0xF0000000;
      LCD->RAM[LCD_RAMRegister_6] |= (tmp <<16) & 0x70000000;
      *SEG_S14_3DP  = point;
      *SEG_S14_3COL = semicom;
      break;

    case 3:
      /*!< Clear the corresponding segments (SEG24, SEG25, SEG26, SEG27) */
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)(0xF8FFFFFF);
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)(0xF0FFFFFF);
      LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)(0xF0FFFFFF);
      LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)(0xF8FFFFFF);

      /*!< Write the corresponding segments (SEG24, SEG25, SEG26, SEG27) */
      tmp = S14_FontMap[offset];
      LCD->RAM[LCD_RAMRegister_0] |= (tmp <<24) & 0x07000000;
      LCD->RAM[LCD_RAMRegister_2] |= (tmp <<20) & 0x0F000000;
      LCD->RAM[LCD_RAMRegister_4] |= (tmp <<16) & 0x0F000000;
      LCD->RAM[LCD_RAMRegister_6] |= (tmp <<12) & 0x07000000;
      *SEG_S14_4DP  = point;
      *SEG_S14_4COL = semicom;
      break;

    case 4:
      /*!< Clear the corresponding segments (SEG20, SEG21, SEG22, SEG23) */
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)(0xFF8FFFFF);
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)(0xFF0FFFFF);
      LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)(0xFF0FFFFF);
      LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)(0xFF8FFFFF);

      /*!< Write the corresponding segments (SEG20, SEG21, SEG22, SEG23) */
      tmp = S14_FontMap[offset];
      LCD->RAM[LCD_RAMRegister_0] |= (tmp <<20) & 0x00700000;
      LCD->RAM[LCD_RAMRegister_2] |= (tmp <<16) & 0x00F00000;
      LCD->RAM[LCD_RAMRegister_4] |= (tmp <<12) & 0x00F00000;
      LCD->RAM[LCD_RAMRegister_6] |= (tmp << 8) & 0x00700000;
      *SEG_S14_5DP  = point;
      *SEG_S14_5COL = semicom;
      break;

    case 5:
      /*!< Clear the corresponding segments (SEG16, SEG17, SEG18, SEG19) */
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)(0xFFF8FFFF);
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)(0xFFF0FFFF);
      LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)(0xFFF0FFFF);
      LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)(0xFFF8FFFF);

      /*!< Write the corresponding segments (SEG16, SEG17, SEG18, SEG19) */
      tmp = S14_FontMap[offset];
      LCD->RAM[LCD_RAMRegister_0] |= (tmp <<16) & 0x00070000;
      LCD->RAM[LCD_RAMRegister_2] |= (tmp <<12) & 0x000F0000;
      LCD->RAM[LCD_RAMRegister_4] |= (tmp << 8) & 0x000F0000;
      LCD->RAM[LCD_RAMRegister_6] |= (tmp << 4) & 0x00070000;
      *SEG_S14_6DP  = point;
      break;

    case 6:
      /*!< Clear the corresponding segments (SEG12, SEG13, SEG14, SEG15) */
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)(0xFFFF8FFF);
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)(0xFFFF0FFF);
      LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)(0xFFFF0FFF);
      LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)(0xFFFF8FFF);

      /*!< Write the corresponding segments (SEG12, SEG13, SEG14, SEG15) */
      tmp = S14_FontMap[offset];
      LCD->RAM[LCD_RAMRegister_0] |= (tmp <<12) & 0x00007000;
      LCD->RAM[LCD_RAMRegister_2] |= (tmp << 8) & 0x0000F000;
      LCD->RAM[LCD_RAMRegister_4] |= (tmp << 4) & 0x0000F000;
      LCD->RAM[LCD_RAMRegister_6] |= (tmp << 0) & 0x00007000;
      break;
  }
}

void LCD_GLASS_DisplaySpecial(uint32_t spec)
{
  /*!< Wait Until the last LCD RAM update finish */
  while(LCD_GetFlagStatus(LCD_FLAG_UDR) != RESET)
  {
  }

  *SEG_PL   		= (SPEC_SEG_PLYS & spec)?1:0;
  *SEG_MN   		= (SPEC_SEG_MINUS & spec)?1:0;
  *SEG_AR   		= (SPEC_SEG_ARROW_RIGHT & spec)?1:0;
	*SEG_AL   		= (SPEC_SEG_ARROW_LEFT & spec)?1:0;
	*SEG_AU   		= (SPEC_SEG_ARROW_UP & spec)?1:0;
	*SEG_AD   		= (SPEC_SEG_ARROW_DOWN & spec)?1:0;
	*SEG_BATT 		= (SPEC_SEG_BATT & spec)?1:0;
	*SEG_BATT_0 	= (SPEC_SEG_BATT_0 & spec)?1:0;
	*SEG_BATT_1 	= (SPEC_SEG_BATT_1 & spec)?1:0;
	*SEG_BATT_2 	= (SPEC_SEG_BATT_2 & spec)?1:0;
	*SEG_BARR_PR 	= (SPEC_SEG_BARR_R & spec)?1:0;
	*SEG_BARR_PL 	= (SPEC_SEG_BARR_L & spec)?1:0;
	*SEG_BARR_P0 	= (SPEC_SEG_BARR_0 & spec)?1:0;
	*SEG_BARR_P1 	= (SPEC_SEG_BARR_1 & spec)?1:0;
	*SEG_BARR_P2 	= (SPEC_SEG_BARR_2 & spec)?1:0;
	*SEG_BARR_P3 	= (SPEC_SEG_BARR_3 & spec)?1:0;
	*SEG_BARR_P4 	= (SPEC_SEG_BARR_4 & spec)?1:0;
	*SEG_BARR_P5 	= (SPEC_SEG_BARR_5 & spec)?1:0;
	*SEG_BARR_P6 	= (SPEC_SEG_BARR_6 & spec)?1:0;
	*SEG_BARR_P7 	= (SPEC_SEG_BARR_7 & spec)?1:0;
	*SEG_BARR_P8 	= (SPEC_SEG_BARR_8 & spec)?1:0;
	*SEG_BARR_P9 	= (SPEC_SEG_BARR_9 & spec)?1:0;
	*SEG_MICRO 		= (SPEC_SEG_MICRO & spec)?1:0;
	*SEG_MIL 			= (SPEC_SEG_MIL & spec)?1:0;
	*SEG_H 				= (SPEC_SEG_H & spec)?1:0;
	*SEG_F 				= (SPEC_SEG_F & spec)?1:0;
	*SEG_OLIMEX   = (SPEC_SEG_OLIMEX & spec)?1:0;

  /*!< Requesy LCD RAM update */
  LCD_UpdateDisplayRequest();

}

void LCD_GLASS_DisplayDigit(uint8_t* digit, Point_Typedef point, Semicol_Typedef semicol,uint8_t position)
{
  uint32_t tmp = 0x00;
  uint8_t offset = *digit & 0xF;

  /*!< Wait Until the last LCD RAM update finish */
  while(LCD_GetFlagStatus(LCD_FLAG_UDR) != RESET)
  {
  }

  switch(position)
  {
  case 0:
      /*!< Clear the corresponding segments (SEG10, SEG11) */
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)(0xFFFFF3FF);
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)(0xFFFFF3FF);
      LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)(0xFFFFF3FF);
      LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)(0xFFFFF7FF);

      /*!< Write the corresponding segments (SEG10, SEG11) */
      tmp = S7A_DigitMap[offset];
      LCD->RAM[LCD_RAMRegister_0] |= (tmp <<10) & 0x0C00;
      LCD->RAM[LCD_RAMRegister_2] |= (tmp << 6) & 0x0C00;
      LCD->RAM[LCD_RAMRegister_4] |= (tmp << 2) & 0x0C00;
      LCD->RAM[LCD_RAMRegister_6] |= (tmp >> 2) & 0x0800;
      *SEG_S7_8P  = point;
    break;
  case 1:
      /*!< Clear the corresponding segments (SEG8, SEG9) */
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)(0xFFFFFCFF);
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)(0xFFFFFCFF);
      LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)(0xFFFFFCFF);
      LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)(0xFFFFFDFF);

      /*!< Write the corresponding segments (SEG8, SEG9) */
      tmp = S7A_DigitMap[offset];
      LCD->RAM[LCD_RAMRegister_0] |= (tmp << 8) & 0x0300;
      LCD->RAM[LCD_RAMRegister_2] |= (tmp << 4) & 0x0300;
      LCD->RAM[LCD_RAMRegister_4] |= (tmp << 0) & 0x0300;
      LCD->RAM[LCD_RAMRegister_6] |= (tmp >> 4) & 0x0200;
      *SEG_S7_9P  = point;
      *SEG_S7_9COL  = semicol;
    break;
  case 2:
      /*!< Clear the corresponding segments (SEG6, SEG7) */
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)(0xFFFFFF3F);
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)(0xFFFFFF3F);
      LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)(0xFFFFFF3F);
      LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)(0xFFFFFFBF);

